# C++类四个默认函数---构造函数、析构函数、拷贝函数、赋值函数
每个类只有一个析构函数和一个赋值函数，但可以有多个构造函数（包含一个拷贝构造函数，其它的称为普通构造函数）。
对于任意一个类A，如果不想编写上述函数，C++编译器将自动为A 产生四个缺省的函数，例如：
```C++
A(void); // 缺省的无参数构造函数

A(const A &a); // 缺省的拷贝构造函数

~A(void); // 缺省的析构函数

A & operate =(const A &a); // 缺省的赋值函数
```
## 注意事项
缺省的拷贝构造函数”和“缺省的赋值函数”均采用“位拷贝”而非“值拷贝”的方式来实现，倘若类中含有指针变量，这两个函数注定将出错。

## 构造函数
构造函数是一种特殊的成员函数，无返回值，函数名与类同名。它提供了对成员变量进行初始化的方法，使得在声明对象时能自动地初始化对象。
因为当程序创建一个对象时，系统会自动调用该对象所属类的构造函数。
1. 一旦类中有了一个带参数的构造函数而又没无参数构造函数的时候系统将无法创建不带参数的对象，此时以下三种声明都是错误的：
```C++
Student stu;
Student *stu = new Student;
Student *stu = new Student();
```
1.1 构造函数初始化列表
初始化表位于函数参数表之后，却在函数体 {} 之前。*这说明该表里的初始化工作发生在函数体内的任何代码被执行之前*。
